Repository: suguby/peewee-migrator
Catalog: migrator/locale/*/LC_MESSAGES/migrator_cli.po
Languages: ru

source: Revision {} not found.
ru: Ревизия {} не найдена.

source: Revision {} has too much matches ({}).
ru: Ревизия {} неоднозначна ({}). Уточните запрос.

source: Config already exists. Overwrite?
ru: Конфиг уже существует. Перезаписать?

source: Database type
ru: Выберите тип базы данных

source: Database
ru: База данных

source: User
ru: Пользователь

source: Password
ru: Пароль

source: Host
ru: Хост

source: Port
ru: Порт

source: Migrations directory
ru: Путь до директории миграций

source: Project directory (For PYTHON_PATH)
ru: Директория с проектом (Для PYTHON_PATH)

source: Models path (Comma separated)
ru: Пути импорта моделей (Разделять запятой)

source: Excluded models by name (Comma separated)
ru: Названия исключенных из миграций базовых моделей (Разделять запятой)

source: Edit config?
ru: Хотите отредактировать итоговый конфиг?

source: Config successfully saved!
ru: Конфиг успешно сохранен!

source: --rev param required
ru: Необходимо указать ревизию через --rev (Поможет migrations_list).

source: Migration title
ru: Название миграции

source: There are no latest migration.
ru: Ещё не было создано ни одной миграции. Миграция от последней невозможна.

source: Migration already applied. Repeat?
ru: Миграция уже применена. Повторить?

source: Abort
ru: Отмена

source: Migration dependencies not applied: {}
ru: Зависимости миграции не применены: {}

source: Migration {} applied successfully!
ru: Миграция {} успешно применена

source: Applied
ru: Применена

source: Dependencies
ru: Зависимости

source: Migration
ru: Миграция

source: Required
ru: Обязательна

source: Time
ru: Время

source: Title
ru: Название

source: No
ru: Нет

source: Yes
ru: Да

source: Revision {} marked as required
ru: Ревизия {} отмечена как обязательная

source: There are no required migrations (Empty required.json)
ru: Нет ни одной обязательной миграции (Пустой required.json)

source: Project already up to date
ru: Все обязательные миграции уже применены
